load-test-agent-messages.yml
config:
  target: 'http://localhost:3000'
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 5
      name: 'Warm-up'
    # Main load phase - 100+ concurrent connections
    - duration: 300
      arrivalRate: 20
      name: 'Main Load'
    # Peak load phase
    - duration: 120
      arrivalRate: 50
      name: 'Peak Load'
    # Cool-down phase
    - duration: 60
      arrivalRate: 5
      name: 'Cool-down'
  defaults:
    headers:
      Content-Type: 'application/json'

scenarios:
  # Scenario 1: Concurrent PDF uploads triggering agent messages
  - name: 'Concurrent PDF Upload with Agent Messages'
    weight: 70
    flow:
      - post:
          url: '/api/documents/upload'
          headers:
            Content-Type: 'multipart/form-data'
          formData:
            file:
              data: '{{ pdfData }}'
              filename: 'load-test-{{ $randomInt }}.pdf'
              mimetype: 'application/pdf'
            ai_transform: 'true'
          capture:
            json: '$.job_id'
            as: 'jobId'
          expect:
            - statusCode: 200
            - hasProperty: 'job_id'
      - think: 2
      - get:
          url: '/api/job-status/{{ jobId }}'
          expect:
            - statusCode: 200
            - hasProperty: 'status'

  # Scenario 2: Rapid agent message generation via sanitization
  - name: 'Rapid Sanitization Requests'
    weight: 20
    flow:
      - post:
          url: '/api/sanitize/json'
          json:
            content: '{{ jsonContent }}'
            classification: 'user_input'
            ai_transform: '{{ $randomBoolean }}'
          expect:
            - statusCode: 200
            - hasProperty: 'sanitizedContent'
            - hasProperty: 'trustToken'

  # Scenario 3: Mixed load with WebSocket simulation
  - name: 'Mixed Load with Message Broadcasting'
    weight: 10
    flow:
      - post:
          url: '/api/documents/upload'
          headers:
            Content-Type: 'multipart/form-data'
          formData:
            file:
              data: '{{ pdfData }}'
              filename: 'mixed-load-{{ $randomInt }}.pdf'
              mimetype: 'application/pdf'
            ai_transform: 'true'
          capture:
            json: '$.job_id'
            as: 'jobId'
      - think: 1
      - post:
          url: '/api/sanitize/json'
          json:
            content: '{{ jsonContent }}'
            classification: 'user_input'
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: '/api/job-status/{{ jobId }}'
          expect:
            - statusCode: 200

before:
  flow:
    - log: 'Starting agent message load testing scenarios'
    - log: 'Testing concurrent PDF processing and agent message generation'

after:
  flow:
    - log: 'Load testing completed'
    - log: 'Checking system performance metrics'

plugins:
  metrics-by-endpoint: {}
  ensure: {}
  apdex: {}
  publish-metrics:
    - type: datadog
      apiKey: '{{ DATADOG_API_KEY }}'
      appKey: '{{ DATADOG_APP_KEY }}'
      prefix: 'mcp_security.load_test'
      tags:
        - 'service:mcp-security'
        - 'test_type:agent_message_load'
        - 'environment:test'

# Custom variables for test data
variables:
  pdfData: 'JVBERi0xLjQKMSAwIG9iago8PAovVHlwZSAvQ2F0YWxvZwovUGFnZXMgMiAwIFIKPj4KZW5kb2JqCjIgMCBvYmoKPDwKL1R5cGUgL1BhZ2VzCi9LaWRzIFszIDAgUl0KL0NvdW50IDEKPj4KZW5kb2JqCjMgMCBvYmoKPDwKL1R5cGUgL1BhZ2UKL1BhcmVudCAyIDAgUgovTWVkaWFCb3ggWzAgMCA2MTIgNzkyXQovQ29udGVudHMgNCAwIFIKPj4KZW5kb2JqCjQgMCBvYmoKPDwKL0xlbmd0aCA0ND4+CnN0cmVhbQpCVAovRjEgMTIgVGYKNzIgNzIwIFRkCihIZWxsbyBXb3JsZCkgVGoKRVQKZW5kc3RyZWFtCmVuZG9iagp4cmVmCjAgNQowMDAwMDAwMDAwIDY1NTM1IGYgCjAwMDAwMDAwMDkgMDAwMDAgbgowMDAwMDAwMDU4IDAwMDAwIG4gCjAwMDAwMDAxMTUgMDAwMDAgbgowMDAwMDAwMjAwIDAwMDAwIG4gCnRyYWlsZXIKPDwKL1NpemUgNQovUm9vdCAxIDAgUgo+PgpzdGFydHhyZWYKMjg0CioqRU9GCg=='

  jsonContent: >
    {
      "user": "load-test-user-{{ $randomInt }}",
      "message": "This is a load testing message with potential XSS content <script>alert('test')</script> and SQL injection attempts",
      "data": {
        "sessionId": "session-{{ $randomInt }}",
        "timestamp": "{{ $randomInt }}",
        "payload": "Large payload data for performance testing and load validation"
      }
    }